---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CutFailures.CannotCutInstanceOutGen
source: html/2b42ec39-be52-abaf-fd13-8899e85471f2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CutFailures.CannotCutInstanceOutGen Property

Can't cut instance(s) of [Symbol] out of its host.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCutInstanceOutGen { get; }
```